perf-results/load-20260425-1257.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 1202 complete and 0 interrupted iterations
default   [   0% ] 02/50 VUs  0m01.0s/5m00.0s

running (0m02.0s), 04/50 VUs, 3153 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m02.0s/5m00.0s

running (0m03.0s), 05/50 VUs, 5881 complete and 0 interrupted iterations
default   [   1% ] 05/50 VUs  0m03.0s/5m00.0s

running (0m04.0s), 07/50 VUs, 8942 complete and 0 interrupted iterations
default   [   1% ] 07/50 VUs  0m04.0s/5m00.0s

running (0m05.0s), 09/50 VUs, 12221 complete and 0 interrupted iterations
default   [   2% ] 09/50 VUs  0m05.0s/5m00.0s

running (0m06.0s), 10/50 VUs, 16061 complete and 0 interrupted iterations
default   [   2% ] 10/50 VUs  0m06.0s/5m00.0s

running (0m07.0s), 12/50 VUs, 20236 complete and 0 interrupted iterations
default   [   2% ] 12/50 VUs  0m07.0s/5m00.0s

running (0m08.0s), 14/50 VUs, 24835 complete and 0 interrupted iterations
default   [   3% ] 14/50 VUs  0m08.0s/5m00.0s

running (0m09.0s), 15/50 VUs, 29759 complete and 0 interrupted iterations
default   [   3% ] 15/50 VUs  0m09.0s/5m00.0s

running (0m10.0s), 17/50 VUs, 34451 complete and 0 interrupted iterations
default   [   3% ] 17/50 VUs  0m10.0s/5m00.0s

running (0m11.0s), 18/50 VUs, 38008 complete and 0 interrupted iterations
default   [   4% ] 18/50 VUs  0m11.0s/5m00.0s

running (0m12.0s), 20/50 VUs, 42939 complete and 0 interrupted iterations
default   [   4% ] 20/50 VUs  0m12.0s/5m00.0s

running (0m13.0s), 22/50 VUs, 47873 complete and 0 interrupted iterations
default   [   4% ] 22/50 VUs  0m13.0s/5m00.0s

running (0m14.0s), 23/50 VUs, 52203 complete and 0 interrupted iterations
default   [   5% ] 23/50 VUs  0m14.0s/5m00.0s

running (0m15.0s), 25/50 VUs, 57570 complete and 0 interrupted iterations
default   [   5% ] 25/50 VUs  0m15.0s/5m00.0s

running (0m16.0s), 27/50 VUs, 63610 complete and 0 interrupted iterations
default   [   5% ] 27/50 VUs  0m16.0s/5m00.0s

running (0m17.0s), 28/50 VUs, 69399 complete and 0 interrupted iterations
default   [   6% ] 28/50 VUs  0m17.0s/5m00.0s

running (0m18.0s), 30/50 VUs, 75203 complete and 0 interrupted iterations
default   [   6% ] 30/50 VUs  0m18.0s/5m00.0s

running (0m19.0s), 32/50 VUs, 81777 complete and 0 interrupted iterations
default   [   6% ] 32/50 VUs  0m19.0s/5m00.0s

running (0m20.0s), 33/50 VUs, 87924 complete and 0 interrupted iterations
default   [   7% ] 33/50 VUs  0m20.0s/5m00.0s

running (0m21.0s), 35/50 VUs, 93196 complete and 0 interrupted iterations
default   [   7% ] 35/50 VUs  0m21.0s/5m00.0s

running (0m22.0s), 36/50 VUs, 99206 complete and 0 interrupted iterations
default   [   7% ] 36/50 VUs  0m22.0s/5m00.0s

running (0m23.0s), 38/50 VUs, 106190 complete and 0 interrupted iterations
default   [   8% ] 38/50 VUs  0m23.0s/5m00.0s

running (0m24.0s), 40/50 VUs, 113094 complete and 0 interrupted iterations
default   [   8% ] 40/50 VUs  0m24.0s/5m00.0s

running (0m25.0s), 41/50 VUs, 120041 complete and 0 interrupted iterations
default   [   8% ] 41/50 VUs  0m25.0s/5m00.0s

running (0m26.0s), 43/50 VUs, 126515 complete and 0 interrupted iterations
default   [   9% ] 43/50 VUs  0m26.0s/5m00.0s

running (0m27.0s), 45/50 VUs, 133129 complete and 0 interrupted iterations
default   [   9% ] 45/50 VUs  0m27.0s/5m00.0s

running (0m28.0s), 46/50 VUs, 139917 complete and 0 interrupted iterations
default   [   9% ] 46/50 VUs  0m28.0s/5m00.0s

running (0m29.0s), 48/50 VUs, 146784 complete and 0 interrupted iterations
default   [  10% ] 48/50 VUs  0m29.0s/5m00.0s

running (0m30.0s), 49/50 VUs, 153670 complete and 0 interrupted iterations
default   [  10% ] 49/50 VUs  0m30.0s/5m00.0s

running (0m31.0s), 50/50 VUs, 160753 complete and 0 interrupted iterations
default   [  10% ] 50/50 VUs  0m31.0s/5m00.0s

running (0m32.0s), 50/50 VUs, 167813 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m32.0s/5m00.0s

running (0m33.0s), 50/50 VUs, 175074 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m33.0s/5m00.0s

running (0m34.0s), 50/50 VUs, 182137 complete and 0 interrupted iterations
default   [  11% ] 50/50 VUs  0m34.0s/5m00.0s

running (0m35.0s), 50/50 VUs, 189394 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m35.0s/5m00.0s

running (0m36.0s), 50/50 VUs, 195645 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m36.0s/5m00.0s

running (0m37.0s), 50/50 VUs, 202021 complete and 0 interrupted iterations
default   [  12% ] 50/50 VUs  0m37.0s/5m00.0s

running (0m38.0s), 50/50 VUs, 208331 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m38.0s/5m00.0s

running (0m39.0s), 50/50 VUs, 213842 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m39.0s/5m00.0s

running (0m40.0s), 50/50 VUs, 219950 complete and 0 interrupted iterations
default   [  13% ] 50/50 VUs  0m40.0s/5m00.0s

running (0m41.0s), 50/50 VUs, 226181 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m41.0s/5m00.0s

running (0m42.0s), 50/50 VUs, 232801 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m42.0s/5m00.0s

running (0m43.0s), 50/50 VUs, 239814 complete and 0 interrupted iterations
default   [  14% ] 50/50 VUs  0m43.0s/5m00.0s

running (0m44.0s), 50/50 VUs, 247169 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m44.0s/5m00.0s

running (0m45.0s), 50/50 VUs, 253868 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m45.0s/5m00.0s

running (0m46.0s), 50/50 VUs, 260513 complete and 0 interrupted iterations
default   [  15% ] 50/50 VUs  0m46.0s/5m00.0s

running (0m47.0s), 50/50 VUs, 268105 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m47.0s/5m00.0s

running (0m48.0s), 50/50 VUs, 275468 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m48.0s/5m00.0s

running (0m49.0s), 50/50 VUs, 282515 complete and 0 interrupted iterations
default   [  16% ] 50/50 VUs  0m49.0s/5m00.0s

running (0m50.0s), 50/50 VUs, 288546 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m50.0s/5m00.0s

running (0m51.0s), 50/50 VUs, 294474 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m51.0s/5m00.0s

running (0m52.0s), 50/50 VUs, 300865 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m52.0s/5m00.0s

running (0m53.0s), 50/50 VUs, 307990 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m53.0s/5m00.0s

running (0m54.0s), 50/50 VUs, 314687 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m54.0s/5m00.0s

running (0m55.0s), 50/50 VUs, 321718 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m55.0s/5m00.0s

running (0m56.0s), 50/50 VUs, 328840 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m56.0s/5m00.0s

running (0m57.0s), 50/50 VUs, 335839 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m57.0s/5m00.0s

running (0m58.0s), 50/50 VUs, 343487 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m58.0s/5m00.0s

running (0m59.0s), 50/50 VUs, 351094 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m59.0s/5m00.0s

running (1m00.0s), 50/50 VUs, 357942 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  1m00.0s/5m00.0s

running (1m01.0s), 50/50 VUs, 365256 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  1m01.0s/5m00.0s

running (1m02.0s), 50/50 VUs, 372429 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m02.0s/5m00.0s

running (1m03.0s), 50/50 VUs, 379426 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m03.0s/5m00.0s

running (1m04.0s), 50/50 VUs, 386456 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  1m04.0s/5m00.0s

running (1m05.0s), 50/50 VUs, 393892 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m05.0s/5m00.0s

running (1m06.0s), 50/50 VUs, 400326 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m06.0s/5m00.0s

running (1m07.0s), 50/50 VUs, 407270 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  1m07.0s/5m00.0s

running (1m08.0s), 50/50 VUs, 414484 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m08.0s/5m00.0s

running (1m09.0s), 50/50 VUs, 421516 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m09.0s/5m00.0s

running (1m10.0s), 50/50 VUs, 428752 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  1m10.0s/5m00.0s

running (1m11.0s), 50/50 VUs, 435955 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m11.0s/5m00.0s

running (1m12.0s), 50/50 VUs, 442961 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m12.0s/5m00.0s

running (1m13.0s), 50/50 VUs, 450014 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  1m13.0s/5m00.0s

running (1m14.0s), 50/50 VUs, 457122 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m14.0s/5m00.0s

running (1m15.0s), 50/50 VUs, 462216 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m15.0s/5m00.0s

running (1m16.0s), 50/50 VUs, 468121 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  1m16.0s/5m00.0s

running (1m17.0s), 50/50 VUs, 473017 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m17.0s/5m00.0s

running (1m18.0s), 50/50 VUs, 479006 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m18.0s/5m00.0s

running (1m19.0s), 50/50 VUs, 485631 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  1m19.0s/5m00.0s

running (1m20.0s), 50/50 VUs, 490763 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m20.0s/5m00.0s

running (1m21.0s), 50/50 VUs, 495061 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m21.0s/5m00.0s

running (1m22.0s), 50/50 VUs, 500854 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  1m22.0s/5m00.0s

running (1m23.0s), 50/50 VUs, 507745 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m23.0s/5m00.0s

running (1m24.0s), 50/50 VUs, 513490 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m24.0s/5m00.0s

running (1m25.0s), 50/50 VUs, 519334 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  1m25.0s/5m00.0s

running (1m26.0s), 50/50 VUs, 525955 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m26.0s/5m00.0s

running (1m27.0s), 50/50 VUs, 533125 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m27.0s/5m00.0s

running (1m28.0s), 50/50 VUs, 540358 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m28.0s/5m00.0s

running (1m29.0s), 50/50 VUs, 547382 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m29.0s/5m00.0s

running (1m30.0s), 50/50 VUs, 554107 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m30.0s/5m00.0s

running (1m31.0s), 50/50 VUs, 561129 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m31.0s/5m00.0s

running (1m32.0s), 50/50 VUs, 568344 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m32.0s/5m00.0s

running (1m33.0s), 50/50 VUs, 575322 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m33.0s/5m00.0s

running (1m34.0s), 50/50 VUs, 581895 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m34.0s/5m00.0s

running (1m35.0s), 50/50 VUs, 589121 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m35.0s/5m00.0s

running (1m36.0s), 50/50 VUs, 595845 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m36.0s/5m00.0s

running (1m37.0s), 50/50 VUs, 602845 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m37.0s/5m00.0s

running (1m38.0s), 50/50 VUs, 609394 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m38.0s/5m00.0s

running (1m39.0s), 50/50 VUs, 616303 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m39.0s/5m00.0s

running (1m40.0s), 50/50 VUs, 623383 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m40.0s/5m00.0s

running (1m41.0s), 50/50 VUs, 630266 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m41.0s/5m00.0s

running (1m42.0s), 50/50 VUs, 637316 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m42.0s/5m00.0s

running (1m43.0s), 50/50 VUs, 644119 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m43.0s/5m00.0s

running (1m44.0s), 50/50 VUs, 651003 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m44.0s/5m00.0s

running (1m45.0s), 50/50 VUs, 658108 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m45.0s/5m00.0s

running (1m46.0s), 50/50 VUs, 664770 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m46.0s/5m00.0s

running (1m47.0s), 50/50 VUs, 671547 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m47.0s/5m00.0s

running (1m48.0s), 50/50 VUs, 678373 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m48.0s/5m00.0s

running (1m49.0s), 50/50 VUs, 685254 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m49.0s/5m00.0s

running (1m50.0s), 50/50 VUs, 690205 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m50.0s/5m00.0s

running (1m51.0s), 50/50 VUs, 695955 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m51.0s/5m00.0s

running (1m52.0s), 50/50 VUs, 701487 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m52.0s/5m00.0s

running (1m53.0s), 50/50 VUs, 708332 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m53.0s/5m00.0s

running (1m54.0s), 50/50 VUs, 715293 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m54.0s/5m00.0s

running (1m55.0s), 50/50 VUs, 722366 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m55.0s/5m00.0s

running (1m56.0s), 50/50 VUs, 729154 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m56.0s/5m00.0s

running (1m57.0s), 50/50 VUs, 736108 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m57.0s/5m00.0s

running (1m58.0s), 50/50 VUs, 743199 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m58.0s/5m00.0s

running (1m59.0s), 50/50 VUs, 749982 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m59.0s/5m00.0s

running (2m00.0s), 50/50 VUs, 757242 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m00.0s/5m00.0s

running (2m01.0s), 50/50 VUs, 764329 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m01.0s/5m00.0s

running (2m02.0s), 50/50 VUs, 771437 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m02.0s/5m00.0s

running (2m03.0s), 50/50 VUs, 778261 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m03.0s/5m00.0s

running (2m04.0s), 50/50 VUs, 784964 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m04.0s/5m00.0s

running (2m05.0s), 50/50 VUs, 791995 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m05.0s/5m00.0s

running (2m06.0s), 50/50 VUs, 798854 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m06.0s/5m00.0s

running (2m07.0s), 50/50 VUs, 805444 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m07.0s/5m00.0s

running (2m08.0s), 50/50 VUs, 812253 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m08.0s/5m00.0s

running (2m09.0s), 50/50 VUs, 817793 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m09.0s/5m00.0s

running (2m10.0s), 50/50 VUs, 823304 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m10.0s/5m00.0s

running (2m11.0s), 50/50 VUs, 829939 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m11.0s/5m00.0s

running (2m12.0s), 50/50 VUs, 837183 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m12.0s/5m00.0s

running (2m13.0s), 50/50 VUs, 844245 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m13.0s/5m00.0s

running (2m14.0s), 50/50 VUs, 851247 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m14.0s/5m00.0s

running (2m15.0s), 50/50 VUs, 857967 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m15.0s/5m00.0s

running (2m16.0s), 50/50 VUs, 864582 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m16.0s/5m00.0s

running (2m17.0s), 50/50 VUs, 871356 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m17.0s/5m00.0s

running (2m18.0s), 50/50 VUs, 878508 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m18.0s/5m00.0s

running (2m19.0s), 50/50 VUs, 885340 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m19.0s/5m00.0s

running (2m20.0s), 50/50 VUs, 891714 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m20.0s/5m00.0s

running (2m21.0s), 50/50 VUs, 897508 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m21.0s/5m00.0s

running (2m22.0s), 50/50 VUs, 903720 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m22.0s/5m00.0s

running (2m23.0s), 50/50 VUs, 910478 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m23.0s/5m00.0s

running (2m24.0s), 50/50 VUs, 917214 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m24.0s/5m00.0s

running (2m25.0s), 50/50 VUs, 923975 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m25.0s/5m00.0s

running (2m26.0s), 50/50 VUs, 930801 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m26.0s/5m00.0s

running (2m27.0s), 50/50 VUs, 937882 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m27.0s/5m00.0s

running (2m28.0s), 50/50 VUs, 944804 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m28.0s/5m00.0s

running (2m29.0s), 50/50 VUs, 951892 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m29.0s/5m00.0s

running (2m30.0s), 50/50 VUs, 958792 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m30.0s/5m00.0s

running (2m31.0s), 50/50 VUs, 965828 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m31.0s/5m00.0s

running (2m32.0s), 50/50 VUs, 972850 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m32.0s/5m00.0s

running (2m33.0s), 50/50 VUs, 979399 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m33.0s/5m00.0s

running (2m34.0s), 50/50 VUs, 986224 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m34.0s/5m00.0s

running (2m35.0s), 50/50 VUs, 993007 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m35.0s/5m00.0s

running (2m36.0s), 50/50 VUs, 999958 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m36.0s/5m00.0s

running (2m37.0s), 50/50 VUs, 1006574 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m37.0s/5m00.0s

running (2m38.0s), 50/50 VUs, 1013027 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m38.0s/5m00.0s

running (2m39.0s), 50/50 VUs, 1019950 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m39.0s/5m00.0s

running (2m40.0s), 50/50 VUs, 1027083 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m40.0s/5m00.0s

running (2m41.0s), 50/50 VUs, 1034044 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m41.0s/5m00.0s

running (2m42.0s), 50/50 VUs, 1040906 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m42.0s/5m00.0s

running (2m43.0s), 50/50 VUs, 1047827 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m43.0s/5m00.0s

running (2m44.0s), 50/50 VUs, 1054906 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m44.0s/5m00.0s

running (2m45.0s), 50/50 VUs, 1061800 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m45.0s/5m00.0s

running (2m46.0s), 50/50 VUs, 1068834 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m46.0s/5m00.0s

running (2m47.0s), 50/50 VUs, 1075557 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m47.0s/5m00.0s

running (2m48.0s), 50/50 VUs, 1082006 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m48.0s/5m00.0s

running (2m49.0s), 50/50 VUs, 1088652 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m49.0s/5m00.0s

running (2m50.0s), 50/50 VUs, 1095160 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m50.0s/5m00.0s

running (2m51.0s), 50/50 VUs, 1101025 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m51.0s/5m00.0s

running (2m52.0s), 50/50 VUs, 1107040 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m52.0s/5m00.0s

running (2m53.0s), 50/50 VUs, 1114049 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m53.0s/5m00.0s

running (2m54.0s), 50/50 VUs, 1119822 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m54.0s/5m00.0s

running (2m55.0s), 50/50 VUs, 1125234 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m55.0s/5m00.0s

running (2m56.0s), 50/50 VUs, 1131354 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m56.0s/5m00.0s

running (2m57.0s), 50/50 VUs, 1137702 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m57.0s/5m00.0s

running (2m58.0s), 50/50 VUs, 1144649 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m58.0s/5m00.0s

running (2m59.0s), 50/50 VUs, 1151601 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m59.0s/5m00.0s

running (3m00.0s), 50/50 VUs, 1158300 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m00.0s/5m00.0s

running (3m01.0s), 50/50 VUs, 1165064 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m01.0s/5m00.0s

running (3m02.0s), 50/50 VUs, 1171648 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m02.0s/5m00.0s

running (3m03.0s), 50/50 VUs, 1178500 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m03.0s/5m00.0s

running (3m04.0s), 50/50 VUs, 1185204 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m04.0s/5m00.0s

running (3m05.0s), 50/50 VUs, 1192442 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m05.0s/5m00.0s

running (3m06.0s), 50/50 VUs, 1199294 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m06.0s/5m00.0s

running (3m07.0s), 50/50 VUs, 1205956 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m07.0s/5m00.0s

running (3m08.0s), 50/50 VUs, 1212650 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m08.0s/5m00.0s

running (3m09.0s), 50/50 VUs, 1219400 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m09.0s/5m00.0s

running (3m10.0s), 50/50 VUs, 1226032 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m10.0s/5m00.0s

running (3m11.0s), 50/50 VUs, 1233093 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m11.0s/5m00.0s

running (3m12.0s), 50/50 VUs, 1239833 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m12.0s/5m00.0s

running (3m13.0s), 50/50 VUs, 1246945 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m13.0s/5m00.0s

running (3m14.0s), 50/50 VUs, 1253807 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m14.0s/5m00.0s

running (3m15.0s), 50/50 VUs, 1260859 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m15.0s/5m00.0s

running (3m16.0s), 50/50 VUs, 1267688 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m16.0s/5m00.0s

running (3m17.0s), 50/50 VUs, 1274505 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m17.0s/5m00.0s

running (3m18.0s), 50/50 VUs, 1281657 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m18.0s/5m00.0s

running (3m19.0s), 50/50 VUs, 1288565 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m19.0s/5m00.0s

running (3m20.0s), 50/50 VUs, 1294604 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m20.0s/5m00.0s

running (3m21.0s), 50/50 VUs, 1300517 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m21.0s/5m00.0s

running (3m22.0s), 50/50 VUs, 1306430 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m22.0s/5m00.0s

running (3m23.0s), 50/50 VUs, 1312951 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m23.0s/5m00.0s

running (3m24.0s), 50/50 VUs, 1319830 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m24.0s/5m00.0s

running (3m25.0s), 50/50 VUs, 1326469 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m25.0s/5m00.0s

running (3m26.0s), 50/50 VUs, 1332906 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m26.0s/5m00.0s

running (3m27.0s), 50/50 VUs, 1339845 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m27.0s/5m00.0s

running (3m28.0s), 50/50 VUs, 1346604 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m28.0s/5m00.0s

running (3m29.0s), 50/50 VUs, 1353439 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m29.0s/5m00.0s

running (3m30.0s), 50/50 VUs, 1360277 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m30.0s/5m00.0s

running (3m31.0s), 50/50 VUs, 1366587 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m31.0s/5m00.0s

running (3m32.0s), 50/50 VUs, 1373485 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m32.0s/5m00.0s

running (3m33.0s), 50/50 VUs, 1380262 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m33.0s/5m00.0s

running (3m34.0s), 50/50 VUs, 1386928 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m34.0s/5m00.0s

running (3m35.0s), 50/50 VUs, 1393405 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m35.0s/5m00.0s

running (3m36.0s), 50/50 VUs, 1400098 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m36.0s/5m00.0s

running (3m37.0s), 50/50 VUs, 1407038 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m37.0s/5m00.0s

running (3m38.0s), 50/50 VUs, 1413857 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m38.0s/5m00.0s

running (3m39.0s), 50/50 VUs, 1419002 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m39.0s/5m00.0s

running (3m40.0s), 50/50 VUs, 1424518 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m40.0s/5m00.0s

running (3m41.0s), 50/50 VUs, 1430605 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m41.0s/5m00.0s

running (3m42.0s), 50/50 VUs, 1437805 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m42.0s/5m00.0s

running (3m43.0s), 50/50 VUs, 1444306 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m43.0s/5m00.0s

running (3m44.0s), 50/50 VUs, 1451276 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m44.0s/5m00.0s

running (3m45.0s), 50/50 VUs, 1457998 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m45.0s/5m00.0s

running (3m46.0s), 50/50 VUs, 1464517 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m46.0s/5m00.0s

running (3m47.0s), 50/50 VUs, 1470653 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m47.0s/5m00.0s

running (3m48.0s), 50/50 VUs, 1477495 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m48.0s/5m00.0s

running (3m49.0s), 50/50 VUs, 1483991 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m49.0s/5m00.0s

running (3m50.0s), 50/50 VUs, 1490273 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m50.0s/5m00.0s

running (3m51.0s), 50/50 VUs, 1494286 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m51.0s/5m00.0s

running (3m52.0s), 50/50 VUs, 1499801 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m52.0s/5m00.0s

running (3m53.0s), 50/50 VUs, 1506471 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m53.0s/5m00.0s

running (3m54.0s), 50/50 VUs, 1512798 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m54.0s/5m00.0s

running (3m55.0s), 50/50 VUs, 1516118 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m55.0s/5m00.0s

running (3m56.0s), 50/50 VUs, 1522423 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m56.0s/5m00.0s

running (3m57.0s), 50/50 VUs, 1528145 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m57.0s/5m00.0s

running (3m58.0s), 50/50 VUs, 1534181 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m58.0s/5m00.0s

running (3m59.0s), 50/50 VUs, 1540021 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m59.0s/5m00.0s

running (4m00.0s), 50/50 VUs, 1546780 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m00.0s/5m00.0s

running (4m01.0s), 50/50 VUs, 1553137 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m01.0s/5m00.0s

running (4m02.0s), 50/50 VUs, 1559930 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m02.0s/5m00.0s

running (4m03.0s), 50/50 VUs, 1566382 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m03.0s/5m00.0s

running (4m04.0s), 50/50 VUs, 1572811 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  4m04.0s/5m00.0s

running (4m05.0s), 50/50 VUs, 1579336 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m05.0s/5m00.0s

running (4m06.0s), 50/50 VUs, 1585932 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m06.0s/5m00.0s

running (4m07.0s), 50/50 VUs, 1592494 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  4m07.0s/5m00.0s

running (4m08.0s), 50/50 VUs, 1599385 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m08.0s/5m00.0s

running (4m09.0s), 50/50 VUs, 1605737 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m09.0s/5m00.0s

running (4m10.0s), 50/50 VUs, 1612117 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  4m10.0s/5m00.0s

running (4m11.0s), 50/50 VUs, 1618726 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m11.0s/5m00.0s

running (4m12.0s), 50/50 VUs, 1624908 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m12.0s/5m00.0s

running (4m13.0s), 50/50 VUs, 1631808 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  4m13.0s/5m00.0s

running (4m14.0s), 50/50 VUs, 1638822 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m14.0s/5m00.0s

running (4m15.0s), 50/50 VUs, 1645458 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m15.0s/5m00.0s

running (4m16.0s), 50/50 VUs, 1652241 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  4m16.0s/5m00.0s

running (4m17.0s), 50/50 VUs, 1658745 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m17.0s/5m00.0s

running (4m18.0s), 50/50 VUs, 1665562 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m18.0s/5m00.0s

running (4m19.0s), 50/50 VUs, 1672280 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  4m19.0s/5m00.0s

running (4m20.0s), 50/50 VUs, 1678540 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m20.0s/5m00.0s

running (4m21.0s), 50/50 VUs, 1682966 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m21.0s/5m00.0s

running (4m22.0s), 50/50 VUs, 1688839 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  4m22.0s/5m00.0s

running (4m23.0s), 50/50 VUs, 1695373 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m23.0s/5m00.0s

running (4m24.0s), 50/50 VUs, 1701429 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m24.0s/5m00.0s

running (4m25.0s), 50/50 VUs, 1706624 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  4m25.0s/5m00.0s

running (4m26.0s), 50/50 VUs, 1710668 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m26.0s/5m00.0s

running (4m27.0s), 50/50 VUs, 1716759 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m27.0s/5m00.0s

running (4m28.0s), 50/50 VUs, 1723465 complete and 0 interrupted iterations
default   [  89% ] 50/50 VUs  4m28.0s/5m00.0s

running (4m29.0s), 50/50 VUs, 1729985 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m29.0s/5m00.0s

running (4m30.0s), 50/50 VUs, 1736669 complete and 0 interrupted iterations
default   [  90% ] 50/50 VUs  4m30.0s/5m00.0s

running (4m31.0s), 49/50 VUs, 1743394 complete and 0 interrupted iterations
default   [  90% ] 49/50 VUs  4m31.0s/5m00.0s

running (4m32.0s), 47/50 VUs, 1750161 complete and 0 interrupted iterations
default   [  91% ] 47/50 VUs  4m32.0s/5m00.0s

running (4m33.0s), 46/50 VUs, 1756680 complete and 0 interrupted iterations
default   [  91% ] 46/50 VUs  4m33.0s/5m00.0s

running (4m34.0s), 44/50 VUs, 1763232 complete and 0 interrupted iterations
default   [  91% ] 44/50 VUs  4m34.0s/5m00.0s

running (4m35.0s), 42/50 VUs, 1769275 complete and 0 interrupted iterations
default   [  92% ] 42/50 VUs  4m35.0s/5m00.0s

running (4m36.0s), 41/50 VUs, 1775613 complete and 0 interrupted iterations
default   [  92% ] 41/50 VUs  4m36.0s/5m00.0s

running (4m37.0s), 39/50 VUs, 1782094 complete and 0 interrupted iterations
default   [  92% ] 39/50 VUs  4m37.0s/5m00.0s

running (4m38.0s), 37/50 VUs, 1788536 complete and 0 interrupted iterations
default   [  93% ] 37/50 VUs  4m38.0s/5m00.0s

running (4m39.0s), 36/50 VUs, 1794821 complete and 0 interrupted iterations
default   [  93% ] 36/50 VUs  4m39.0s/5m00.0s

running (4m40.0s), 34/50 VUs, 1801451 complete and 0 interrupted iterations
default   [  93% ] 34/50 VUs  4m40.0s/5m00.0s

running (4m41.0s), 32/50 VUs, 1807069 complete and 0 interrupted iterations
default   [  94% ] 32/50 VUs  4m41.0s/5m00.0s

running (4m42.0s), 31/50 VUs, 1813045 complete and 0 interrupted iterations
default   [  94% ] 31/50 VUs  4m42.0s/5m00.0s

running (4m43.0s), 29/50 VUs, 1818620 complete and 0 interrupted iterations
default   [  94% ] 29/50 VUs  4m43.0s/5m00.0s

running (4m44.0s), 27/50 VUs, 1824070 complete and 0 interrupted iterations
default   [  95% ] 27/50 VUs  4m44.0s/5m00.0s

running (4m45.0s), 26/50 VUs, 1829227 complete and 0 interrupted iterations
default   [  95% ] 26/50 VUs  4m45.0s/5m00.0s

running (4m46.0s), 24/50 VUs, 1834641 complete and 0 interrupted iterations
default   [  95% ] 24/50 VUs  4m46.0s/5m00.0s

running (4m47.0s), 22/50 VUs, 1839608 complete and 0 interrupted iterations
default   [  96% ] 22/50 VUs  4m47.0s/5m00.0s

running (4m48.0s), 21/50 VUs, 1845502 complete and 0 interrupted iterations
default   [  96% ] 21/50 VUs  4m48.0s/5m00.0s

running (4m49.0s), 19/50 VUs, 1850618 complete and 0 interrupted iterations
default   [  96% ] 19/50 VUs  4m49.0s/5m00.0s

running (4m50.0s), 17/50 VUs, 1855081 complete and 0 interrupted iterations
default   [  97% ] 17/50 VUs  4m50.0s/5m00.0s

running (4m51.0s), 16/50 VUs, 1858858 complete and 0 interrupted iterations
default   [  97% ] 16/50 VUs  4m51.0s/5m00.0s

running (4m52.0s), 14/50 VUs, 1862336 complete and 0 interrupted iterations
default   [  97% ] 14/50 VUs  4m52.0s/5m00.0s

running (4m53.0s), 12/50 VUs, 1866253 complete and 0 interrupted iterations
default   [  98% ] 12/50 VUs  4m53.0s/5m00.0s

running (4m54.0s), 11/50 VUs, 1870523 complete and 0 interrupted iterations
default   [  98% ] 11/50 VUs  4m54.0s/5m00.0s

running (4m55.0s), 09/50 VUs, 1874283 complete and 0 interrupted iterations
default   [  98% ] 09/50 VUs  4m55.0s/5m00.0s

running (4m56.0s), 07/50 VUs, 1877798 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  4m56.0s/5m00.0s

running (4m57.0s), 06/50 VUs, 1880742 complete and 0 interrupted iterations
default   [  99% ] 06/50 VUs  4m57.0s/5m00.0s

running (4m58.0s), 04/50 VUs, 1883229 complete and 0 interrupted iterations
default   [  99% ] 04/50 VUs  4m58.0s/5m00.0s

running (4m59.0s), 02/50 VUs, 1885324 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  4m59.0s/5m00.0s

running (5m00.0s), 01/50 VUs, 1886465 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  5m00.0s/5m00.0s

running (5m00.0s), 00/50 VUs, 1886471 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=5.15ms
    ✓ 'p(99)<1000' p(99)=8.05ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5659413 18864.534057/s
    checks_succeeded...: 100.00% 5659413 out of 5659413
    checks_failed......: 0.00%   0 out of 5659413

    ✓ list is 200
    ✓ detail is 200
    ✓ search is 200

    HTTP
    http_req_duration..............: avg=2.36ms min=193µs    med=1.92ms max=244.38ms p(90)=4.18ms  p(95)=5.15ms 
      { expected_response:true }...: avg=2.36ms min=193µs    med=1.92ms max=244.38ms p(90)=4.18ms  p(95)=5.15ms 
    http_req_failed................: 0.00%   0 out of 5659413
    http_reqs......................: 5659413 18864.534057/s

    EXECUTION
    iteration_duration.............: avg=7.16ms min=738.45µs med=6.64ms max=266.76ms p(90)=10.68ms p(95)=12.43ms
    iterations.....................: 1886471 6288.178019/s
    vus............................: 1       min=1            max=50
    vus_max........................: 50      min=50           max=50

    NETWORK
    data_received..................: 7.8 GB  26 MB/s
    data_sent......................: 715 MB  2.4 MB/s



running (5m00.0s), 00/50 VUs, 1886471 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s